//\\ \\ \\ \\ \\ \\ \\ \\ || || || || || || // // // // // // // //
// \\ \\ \\ \\ \\ \\ \\        _ooOoo_          // // // // // // //
//\\ \\ \\ \\ \\ \\          o8888888o            // // // // // //
//\\ \\ \\ \\ \\             88" . "88               // // // // //
//\\ \\ \\ \\                (| -_- |)                  // // // //
//\\ \\ \\                   O\  =  /O                     // // //
//\\ \\                   ____/`---'\____                     // //
//\\                    .'  \\|     |//  `.                      //
//==                   /  \\|||  :  |||//  \                     ==
//==                  /  _||||| -:- |||||-  \                    ==
//==                  |   | \\\  -  /// |   |                    ==
//==                  | \_|  ''\---/''  |   |                    ==
//==                  \  .-\__  `-`  ___/-. /                    ==
//==                ___`. .'  /--.--\  `. . ___                  ==
//==              ."" '<  `.___\_<|>_/___.'  >'"".               ==
//==            | | :  `- \`.;`\ _ /`;.`/ - ` : | |              \\
////            \  \ `-.   \_ __\ /__ _/   .-` /  /              \\
////      ========`-.____`-.___\_____/___.-`____.-'========      \\
////                           `=---='                           \\
//// //   ^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^  \\ \\
//// // //      佛祖保佑      永无BUG      永不修改        \\ \\ \\ \\
//// // // // // // || || || || || || || || || || \\ \\ \\ \\ \\ \\

#include<bits/stdc++.h>

using namespace std;

typedef long long ll;

ll x, m, M, r, y, z;
int n;
ll A, B;

ll gcd(ll a, ll b) {
    return b == 0 ? a : gcd(b, a % b);
}

void inv(ll a, ll b) {
    if (a % b == 0) {
        z = 0;
        y = 1;
        return;
    }
    inv(b, a % b);
    ll r = z;
    z = y;
    y = r - a / b * y;
}

void solve() {
    x = 0;
    m = 1;
    for (int i = 0; i < 2; i++) {
        if(i == 0){
            cin >> M >> r;
            A = M;
            B = r;
            r = 0;
        }else{
            M = B, r = 1;
        }
        ll b = r - x, d = gcd(m, M);
        if (b % d) {
            cout << "-1" << endl;//不存在
            return;
        }
        inv(m / d, M / d);
        ll t = b / d * z % (M / d);
        x += m * t;
        m *= M / d;
    }
    x = x > 0 ? x : x + m;
    cout << x / A << endl;
}
int main(void) {
#ifdef ACM_LOCAL
    freopen("in.txt", "r", stdin);
    freopen("out.txt", "w", stdout);
#endif
    ios::sync_with_stdio(false);
    cin.tie(0);
    cout.tie(0);

    solve();
}